app/Actions/Fortify/CreateNewUser.php

insert into `users` (`name`, `email`, `phone`, `address`, `password`, `updated_at`, `created_at`) values ('Gian', 'test@email.com', '123123123', 'asdasdasd', '$2y$10$fpuf0Mr3Rt393sLKHLLo4ORlhDby5Zza.HLgvBmx1vrc/oQOvf84S', '2023-03-22 19:28:19', '2023-03-22 19:28:19')
---
    public function create(array $input): User
    {
        Validator::make($input, [
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'phone' => ['required', 'regex:/^[0-9]{11}$/', 'digits:11'],
            'phone.regex' => 'Please enter a valid 11-digit phone number.',
            'phone.digits' => 'Please enter a valid 11-digit phone number.',
            'password' => $this->passwordRules(),
            'terms' => Jetstream::hasTermsAndPrivacyPolicyFeature() ? ['accepted', 'required'] : '',
        ])->validate();

        return User::create([
            'name' => $input['name'],
            'email' => $input['email'],
            'phone' => $input['phone'],
            'address' => $input['address'],
            'password' => Hash::make($input['password']),
        ]);